brew "zsh"
brew "pyenv"
brew "jawshooah/pyenv/pyenv-default-packages", args: ["HEAD"]
brew "fish"
brew "cloc"
brew "fortune"
brew "ctags"
brew "fzf"
brew "go"
brew "jq"
brew "neovim", args: ["HEAD"]
brew "shellcheck"
brew "tfenv"
brew "fd"
brew "gotop"
brew "tree"
brew "ondir"
brew "csvkit"
brew "tmux"
brew "bat"
{{- if eq .chezmoi.os "linux" }}

# Linux Specific Packages
tap "jonasmalacofilho/homebrew-liquidctl"
brew "jonasmalacofilho/liquidctl/liquidctl"
brew "aws-vault"
{{- else if eq .chezmoi.os "darwin" }}

# Mac Specific Packages
tap "koekeishiya/formulae"
brew "yabai"

brew "sassc"
brew "archey"
cask "aws-vault"
cask "alacritty"
cask "ubersicht"
brew "pidof"
brew "m-cli", args: ["HEAD"]

tap "homebrew/cask-fonts"
cask "font-hasklig-nerd-font-mono"
{{- end }}
