brew "zsh"
brew "pyenv"
brew "jawshooah/pyenv/pyenv-default-packages", args: ["HEAD"]
brew "fish"
brew "cloc"
brew "fortune"
brew "ctags"
brew "fzf"
brew "go"
brew "jq"
brew "neovim", args: ["HEAD"]
brew "shellcheck"
brew "tfenv"
brew "fd"
brew "aws-vault"
brew "gotop"
brew "tree"
brew "ondir"
brew "csvkit"
{{- if eq .chezmoi.os "linux" }}
tap "jonasmalacofilho/homebrew-liquidctl"
brew "jonasmalacofilho/liquidctl/liquidctl"
{{- end }}
